Autodesk.Revit.DB.BuiltInFailures.ForeignFileFailures.ForeignLink
This file [RvtLinkName] was saved by an application that was not developed or licensed by Autodesk.

Autodesk.Revit.DB.BuiltInFailures.ForeignFileFailures.ForeignFile
This file [FamilyName] was saved by an application that was not developed or licensed by Autodesk.

Autodesk.Revit.DB.BuiltInFailures.ForeignFileFailures
Failures about files saved by applications that were not developed or licensed by Autodesk.